modm-ext/archive-stmicro-svd/header_stm32h723veh6.svd
      <register>
        <name>CFG2</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MSSI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>MIDI</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>IOSWP</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMM</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SP</name>
            <bitOffset>19</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>MASTER</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSBFRST</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CPHA</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CPOL</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSIOP</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSOE</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSOM</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AFCNTR</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IER</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RXPIE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXPIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DXPIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOTIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXTFIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UDRIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVRIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEIE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIFREIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MODFIE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSERFIE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RXP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DXP</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOT</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXTF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UDR</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIFRE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MODF</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSERF</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SUSP</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXC</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXPLVL</name>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RXWNE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTSIZE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IFCR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EOTC</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXTFC</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UDRC</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVRC</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEC</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIFREC</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MODFC</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSERFC</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SUSPC</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXDR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RXDR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RXDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CRCPOLY</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRCPOLY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXCRC</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXCRC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RXCRC</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RXCRC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>UDRDR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UDRDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>I2SCFGR</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>I2SMOD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2SCFG</name>
            <bitOffset>1</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>I2SSTD</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PCMSYNC</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DATLEN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CHLEN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKPOL</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FIXCH</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSINV</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DATFMT</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2SDIV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ODD</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCKOE</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>I2C4</name>
      <baseAddress>0x58001c00</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDRIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOPIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DNF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ANFOFF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXDMAEN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXDMAEN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBC</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NOSTRETCH</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUPEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GCEN</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBHEN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBDEN</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALERTEN</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECEN</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR2</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SADD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>RD_WRN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADD10</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HEAD10R</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>START</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOP</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACK</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NBYTES</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RELOAD</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AUTOEND</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECBYTE</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OAR1</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OA1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>OA1MODE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OA1EN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OAR2</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OA2</name>
            <bitOffset>1</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>OA2MSK</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>OA2MASK06</name>
            <bitOffset>9</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OA2MASK04</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OA2EN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMINGR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SCLL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SCLH</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SDADEL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SCLDEL</name>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>PRESC</name>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMEOUTR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TIMEOUTA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>TIDLE</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMOUTEN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMEOUTB</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>TEXTEN</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXIS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDR</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOPF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCR</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BERR</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ARLO</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECERR</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMEOUT</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALERT</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSY</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDCODE</name>
            <bitOffset>17</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ICR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADDRCF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKCF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOPCF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BERRCF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ARLOCF</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVRCF</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECCF</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIMOUTCF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALERTCF</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PECR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PEC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
